app/controllers/movies_controller.rb

    params[:order] = session[:order]
    @order = params[:order]
    if(@order == "title")
      @movies = Movie.order("LOWER(#{@order})")
---
SELECT "movies".* FROM "movies" WHERE (rating in ('G','PG','PG-13','R','NC-17')) ORDER BY lower(release_date)

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "movies" SET "title" = 'fiuuuuu', "rating" = 'PG-13', "updated_at" = '2014-03-14 06:15:30.776798' WHERE "movies"."id" = 6